shop_api/app/controllers/shopitems_controller.rb

SELECT "shopitems".* FROM "shopitems"
---
  def index
    @shopitems = Shopitem.all